\section{Switch}
\subsection{Configuration Cisco}


\subsubsection{Reset et paramètres par défaut}

Pour réinitialiser la configuration du 802.1X sur le switch :

\begin{verbatim}
Switch(config)# dot1x default
\end{verbatim}

La configuration par défaut est :
\begin{itemize}
\item Authentication, authorization, and accounting (AAA) authentication <-> Disable
Disabled. 
\item RADIUS server : IP address <-> None specified
\item RADIUS server : UDP authentication port <-> 1812
\item RADIUS server : Key <-> None specified
\item Per-interface 802.1X enable state <-> Disabled (force-authorized)
\item Periodic re-authentication <-> Disabled
\item Number of seconds between re-authentication attempts <-> 3600 seconds
\item Quiet period <-> 60 seconds
\item Retransmission time <-> 30 seconds
\item Maximum retransmission number <-> 2 times
\item Multiple host support <-> Disabled
\end{itemize}



\subsubsection{Donner une IP au Switch}
\begin{alltt}
Switch(config)# interface vlan 1
Switch(config-if)# ip addr \emph{192.168.0.10} 255.255.255.0
Switch(config-if)# no shutdown
Switch(config-if)# exit
\end{alltt}

\subsubsection{Activer le 802.1X sur le switch}

\begin{verbatim}
Switch(config)# aaa new-model
Switch(config)# aaa authentication dot1x default group radius
Switch(config)# dot1x system-auth-control
\end{verbatim}
\subsubsection{Configurer une interface}

L'interface dois être en mode 'access'. 
Si ce n'est pas le cas,
\begin{verbatim}
Switch(config)# interface fastethernet0/1
Switch(config-if)# switchport mode access
\end{verbatim}

puis,

\begin{verbatim}
Switch(config-if)# dot1x port-control auto
\end{verbatim}

\subsubsection{Incompatibilités}

La fonctionnalité 802.1X ne peut être activée sur les ports :
\begin{enumerate}
\item Trunk
\item Dynamic
\item Dynamic-access
\item Etherchannel
\item Secure
\item Switch Port Analyzer (SPAN)
\end{enumerate}


\subsubsection{Configurer un serveur radius}
Pour configurer un serveur radius~:
\begin{verbatim}
Switch(config)# aaa new-model
Switch(config)# radius-server host 192.168.1.10 auth-port 1812 key mysecret 
\end{verbatim}
L'ip du radius est suposée être 192.168.1.10 et le secret 'mysecret'.

\subsubsection{Authentification périodique}

\begin{verbatim}
Switch(config)# dot1x re-authentication
Switch(config)# dot1x timeout re-authperiod 4000
\end{verbatim}

\subsubsection{Période entre 2 tentatives de connexions}

\begin{verbatim}
Switch(config)# dot1x timeout quiet-period 30
\end{verbatim}

\subsubsection{Période entre 2 paquets EAP Request/Identity}

\begin{verbatim}
Switch(config)# dot1x timeout tx-period 60
\end{verbatim}

\subsubsection{Nombre maximum de paquets EAP Request/Identity}

\begin{verbatim}
Switch(config)# dot1x max-req 5
\end{verbatim}

\subsubsection{Plusieurs 'Host' sur une seule interface}

\begin{verbatim}
Switch(config-if)# dot1x multiple-hosts
\end{verbatim}

Note : Un host identifié donne accès au réseau à tous les autres. Un host qui se déconnecte bloque l'accès à tous les autres.

\subsubsection{Débuguer}

\begin{verbatim}
Switch(config)# show dot1x
Switch(config)# show dot1x statistics
Switch# debug dot1x all
\end{verbatim}

\subsubsection{VLAN invité}

\begin{verbatim}
Switch(config-if)# dot1x guest-vlan { vlan-id }
\end{verbatim}



\subsection{Authentification sur le port Console et les VTY}

\subsubsection{Identifiants Radius}

Pour permettre à quelqu'un de configurer le switch grâce à ses identifiants Radius, il faut procéder comme ceci :

\begin{verbatim}
Swicth>enable
Switch#configure terminal
Switch(config)#aaa authentication login default group radius
Switch(config)#aaa authentication enable default group radius
Switch(config)#line console 0
Switch(config-line)#login authentication default
Switch(config-line)#line vty 0 15
Switch(config-line)#login authentication default
\end{verbatim}

Les identifiants utilisés pour la connexion au port console sont lus dans la base de donnée, il suffit d'ajouter un utilisateur. Cependant, l'accès au mode \textit{enable} requiert une action supplémentaire sur le serveur Radius.

En effet, il faut ajouter une ligne au fichier \textit{sql.conf} :

\begin{verbatim}
safe-characters = "@0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789.-_: /$"
\end{verbatim}

Et ajouter un utilisateur particulier :

\begin{verbatim}
insert into radcheck (username,attribute,value) values ('$enab15$','Cleartext-Password','plop');
\end{verbatim}

\subsubsection{Identifiants de secours}

Si jamais le serveur Radius n'est pas joignable, personne ne pourra se connecter au switch pour le configurer. Or, lorsqu'un réseau tombe en panne, il est probable qu'il faille configurer le switch alors que le serveur Radius n'est plus accessible. C'est pourquoi on va installer des identifiants de secours qui ne seront utilisés uniquement dans le cas où le server Radius ne répond pas. Pour ce faire, il faut suivre la procédure suivante :

\begin{verbatim}
Swicth>enable
Switch#configure terminal
Switch(config)#aaa authentication login default group radius local
Switch(config)#aaa authentication enable default group radius enable
Switch(config)#enable password plop
Switch(config)#username bla password plop
\end{verbatim}

Dans notre cas, si le serveur ne répond pas, il faudra utiliser les identifants (bla, plop) pour se connecter sur le port console et le mot de passe (plop) pour accéder au mode \textit{enable}.
