\section{Commutateur}
\subsection{Configuration Cisco}
\subsubsection{Réinitialisation et paramètres par défaut}

Pour réinitialiser la configuration du 802.1x sur le commutateur~:

\begin{lstlisting}
Switch(config)# dot1x default
\end{lstlisting}

La configuration par défaut est~:

\begin{itemize}
\item Authentication, authorization, and accounting (AAA) authentication <-> Disable Disabled. 
\item RADIUS server : IP address <-> None specified
\item RADIUS server : UDP authentication port <-> 1812
\item RADIUS server : Key <-> None specified
\item Per-interface 802.1X enable state <-> Disabled (force-authorized)
\item Periodic re-authentication <-> Disabled
\item Number of seconds between re-authentication attempts <-> 3600 seconds
\item Quiet period <-> 60 seconds
\item Retransmission time <-> 30 seconds
\item Maximum retransmission number <-> 2 times
\item Multiple host support <-> Disabled
\end{itemize}

\subsubsection{Attribuer une adresse IP}

Exemple en IPv4~:

\begin{lstlisting}
Switch(config)# interface vlan 1
Switch(config-if)# ip addr 192.168.0.10 255.255.255.0
Switch(config-if)# no shutdown
Switch(config-if)# exit
\end{lstlisting}

\subsubsection{Activer le 802.1x}

Activation du protocole~:

\begin{lstlisting}
Switch(config)# aaa new-model
Switch(config)# aaa authentication dot1x default group radius
Switch(config)# dot1x system-auth-control
\end{lstlisting}

\subsubsection{Configurer une interface}

L'interface dois être en mode \emph{access}~:

\begin{lstlisting}
Switch(config)# interface fastethernet0/1
Switch(config-if)# switchport mode access
\end{lstlisting}

Activer sur le 802.1x pour cette interface~:

\begin{lstlisting}
Switch(config-if)# dot1x port-control auto
\end{lstlisting}

\subsubsection{Incompatibilités}

Le protocole 802.1x ne peut pas être activé sur les ports suivants~:

\begin{enumerate}
\item Trunk
\item Dynamic
\item Dynamic-access
\item Etherchannel
\item Secure
\item Switch Port Analyzer (SPAN)
\end{enumerate}

\subsubsection{Lier à un serveur Radius}

Ajouter la définition d'un serveur Radius (\emph{192.168.1.10})~:

\begin{lstlisting}
Switch(config)# aaa new-model
Switch(config)# radius-server host 192.168.1.10 auth-port 1812 key mysecret
\end{lstlisting}

\subsubsection{Authentification périodique}

Activer la réauthentification périodique~:

\begin{lstlisting}
Switch(config)# dot1x re-authentication
Switch(config)# dot1x timeout re-authperiod 4000
\end{lstlisting}

\subsubsection{Déboguer}

Pour obtenir des informations concernant le fonctionnement actuel du 802.1x sur le commutateur~:

\begin{lstlisting}
Switch(config)# show dot1x
Switch(config)# show dot1x statistics
Switch# debug dot1x all
\end{lstlisting}

\subsubsection{VLAN invité}

Pour définir un réseau virtuel par défaut~:

\begin{lstlisting}
Switch(config-if)# dot1x guest-vlan { vlan_id }
\end{lstlisting}

\subsection{Authentification sur le port console et les VTY}
\subsubsection{Identifiants Radius}

Commencer par ajouter le mode d'authentification~:

\begin{lstlisting}
Swicth>enable
Switch#configure terminal
Switch(config)#aaa authentication login default group radius
Switch(config)#aaa authentication enable default group radius
\end{lstlisting}

Pour l'activer sur le port console~:

\begin{lstlisting}
Switch(config)#line console 0
Switch(config-line)#login authentication default
\end{lstlisting}

Pour l'activer sur les connexions Telnet~:

\begin{lstlisting}
Switch(config)#line vty 0 15
Switch(config-line)#login authentication default
\end{lstlisting}

L'accès au mode \textit{enable} requiert une action supplémentaire sur le serveur Radius.

Pour l'activer, ajouter cette ligne au fichier \textit{sql.conf}~:

\begin{lstlisting}
safe-characters = "@0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789.-_: /$"
\end{lstlisting}

Puis ajouter un utilisateur particulier~:

\begin{lstlisting}
$ sudo echo "INSERT INTO radcheck (username,attribute,value) VALUES ('$enab15$','Cleartext-Password','motdepasse_enable')" | mysql -uroot -p radius
\end{lstlisting}

\subsubsection{Identifiants de secours}

Si jamais le serveur Radius n'est pas joignable, personne ne pourra se connecter au commutateur pour le configurer. Lorsqu'un réseau tombe en panne, il est probable qu'il faille configurer le commutateur alors que le serveur Radius n'est plus accessible. C'est pourquoi il faut faut installer des identifiants de secours qui ne seront utilisés que dans le cas où le server Radius ne répond pas.

Suivre la procédure suivante~:

\begin{lstlisting}
Swicth>enable
Switch#configure terminal
Switch(config)#aaa authentication login default group radius local
Switch(config)#aaa authentication enable default group radius enable
Switch(config)#enable password motdepasse_enable_secours
Switch(config)#username utilisateur_secours password motdepasse_secours
\end{lstlisting}

Si le serveur ne répond pas, il faudra utiliser l'utilisateur \emph{utilisateur\_secours} et le mot de passe \emph{motdepasse\_secours} pour se connecter sur le port console. Le mot de passe \emph{motdepasse\_enable\_secours} pourra être utilisé pour passer en mode privilégié.
